package main

type numberLibs struct {
	units    map[int]string
	teens    map[int]string
	tens     map[int]string
	hundreds map[int]string
}

func numberLibsGet() numberLibs {
	return numberLibs{
		units: map[int]string{
			0: "ноль", 1: "один", 2: "два", 3: "три", 4: "четыре",
			5: "пять", 6: "шесть", 7: "семь", 8: "восемь", 9: "девять",
		},
		teens: map[int]string{
			11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
			14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
			17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать",
		},
		tens: map[int]string{
			1: "десять", 2: "двадцать", 3: "тридцать", 4: "сорок",
			5: "пятьдесят", 6: "шестьдесят", 7: "семьдесят",
			8: "восемьдесят", 9: "девяносто",
		},
		hundreds: map[int]string{
			1: "сто", 2: "двести", 3: "триста", 4: "четыреста",
			5: "пятьсот", 6: "шестьсот", 7: "семьсот",
			8: "восемьсот", 9: "девятьсот",
		},
	}
}
